{
    "blocks": [
      {
        "id": 1,
        "imgSrc": "/img/Pazzle.png",
        "imgAlt": "First",
        "title": "Проект на C# (WPF)",
        "description": "Мой первый достаточно серьезный проект на языке C# это игра Pazzle нужно на время собрать картинку. Проект создан с помощью MVVM (Model-View-ViewModel) — это паттерн проектирования пользовательского интерфейса, который помогает разделить задачи разработки между программистами и дизайнерами. Model (модель) — это бизнес-логика приложения, View (представление) — визуальная часть, а ViewModel (модель представления) связывает их между собой."
      },
      {
        "id": 2,
        "imgSrc": "/img/GameDB.png",
        "imgAlt": "Second",
        "title": "ASP.net Core, C#",
        "description": "Еще один интересный проек это сайт поиска игр (в поисковой строке забиваешь название интересующей тебя игры и он находит тебе все выпуски и на каких платформах выпущенна данная игра, с подробным описанием). Реализовано с помощью MVC (Model-View-Controller) - это паттерн проектирования, который используется для структурирования приложений. Model (Модель) - это логика приложения, которая обрабатывает данные и бизнес-правила. Модель отвечает за взаимодействие с базой данных, обработку запросов от контроллера и представление результатов. View (Представление) - это часть приложения, которая отвечает за отображение данных пользователю. View может быть представлено в виде графического интерфейса пользователя (GUI), веб-страницы или другого формата вывода. Controller (Контроллер) - это компонент, который обрабатывает пользовательские вводы и передает их соответствующей модели или представлению. Контроллер также может обрабатывать события, такие как клики мыши или нажатия клавиш."
      },
      {
        "id": 3,
        "imgSrc": "/img/weather.png",
        "imgAlt": "Third",
        "title": "JS,CSS,HTML",
        "description": "Прогноз погоды, это веб приложение написано с помощью HTML, CSS(sass), JS "
      },
      {
        "id": 4,
        "imgSrc": "/img/Millionaire.png",
        "imgAlt": "Forth",
        "title": "Angular",
        "description": "Игра \"кто хочет стать миллионером\""
      }
    ]
  }